# Pandas tutorial

## Introduction to Pandas Data Structures
The two most common data structures of `pandas` are
- `Series`
- `DataFrame`

The `Series` is designed to accommodate one-dimensional `ndarray` data with axis labels (e.g., time series data), and the `Dataframe` is designed for two-dimensional tabular data with labeled axes (rows and columns).

## Series
As shown below, the structure of the `Series` object is simple, which consists of two columns - **Index** and **Value** - with the same length. The **Value** column holds the data (of any `NumPy` type) which is associated with labels in the **Index** column.

|Index|Value|
|:---|--:|
|0|-1|
|1|3|
|2|8|

### Defining a Series

We can call the `pd.Series()` function to create a `Series` object and specify the argument `data` to be a `Numpy` array, a list, a dictionary, or a scalar value.

In [1]:
import numpy as np
import pandas as pd

# Since 'data' is the first location parameter, you can also ignore 'data=' and directly specify the value
s1 = pd.Series(data=np.array([-1, 3, 8]))    # Numpy array
s2 = pd.Series(data=[-1, 3, 8])              # List
s3 = pd.Series(data={'a':-1, 'b':3, 'c':8})  # Dictionary
s4 = pd.Series(data=-1)                      # Scalar
print(s1)
print(s2)
print(s3)
print(s4)

0   -1
1    3
2    8
dtype: int64
0   -1
1    3
2    8
dtype: int64
a   -1
b    3
c    8
dtype: int64
0   -1
dtype: int64

As you can see from the output of the `Series` object, the left column is the `Index`, which is a series of labels, and the right is a series of corresponding values.

:::{note}
If you do not specify the value of index when creating the series, by default, `Pandas` will assign the sequence number starting from 0 as the index. If the data is in the type of dictionary, the keys will be used as the index of the series.
:::

In general, it is better to create a `Series` object with meaningful labels to distinguish and identify each value. When constructing the `Series`, the labels are added by specifying the value of the `index` parameter or specifying the `data` as a `dict` object as we mentioned above.

In [2]:
s5 = pd.Series([-1, 3, 8], index=['x', 'y', 'z'])  # specify the index by 'index' option
print(s5)

x   -1
y    3
z    8
dtype: int64

:::{note}
Always keep in mind that when specifying the argument `data` as a `Numpy` array, the values contained in the `NumPy` array are not copied, but are passed by reference. That is, the object is inserted
dynamically within the new `Series` object. If the values of `NumPy` array change, those changes will also present in the `Series` object.
:::

In [3]:
arr = np.array([100, 20, -3])

s6 = pd.Series(arr, index=['x', 'y', 'z'] )
print(arr)
print(s6)

arr[2] = -40
print('\n')
print(arr)
print("After reassigning value, the value of series \nalso will be updated automatically:")
print(s6)

[100  20  -3]
x    100
y     20
z     -3
dtype: int64


[100  20 -40]
After reassigning value, the value of series
also will be updated automatically:
x    100
y     20
z    -40
dtype: int64

As you can see in this example, by changing the third element of the `arr` array, we
also modified the corresponding element in the `s6` series.

 You can call the attributes - index and values - of the series to see them separately.

In [4]:
print(s6.values)
print(s6.index)

[100  20 -40]
Index(['x', 'y', 'z'], dtype='object')

### Selecting the Elements

You can select any individual element in the same way as `Numpy` arrays by specifying the sequence number.

In [5]:
s = pd.Series(data={'a':-1, 'b':3, 'c':8})
s[1]

3

Or you can specify the value of the index.

In [6]:
s['a']

-1

Similar to `Numpy` arrays, you can also select multiple items by specifying number or label slices.

In [7]:
print(s[0:2])
print(s['a':'c'])

a   -1
b    3
dtype: int64
a   -1
b    3
c    8
dtype: int64

:::{note}
Notice that the number-based slice does not contain the last element of the slice (like `Numpy` arrays), but the label-based slice contains the last element.
:::

### Assigning Values to the Elements

In [8]:
s['a'] = 100
s[2] = 80
s

a    100
b      3
c     80
dtype: int64

### Filtering Values

If you need to get the indexes and values of the elements in the series that are greater than 4, you
write the following

In [9]:
s = pd.Series([1, 3, 5, 2, 10])
idx_greater = s > 4
# According to Boolean value to filter
print(idx_greater)
print(s[idx_greater])  # greater than 4

0    False
1    False
2     True
3    False
4     True
dtype: bool
2     5
4    10
dtype: int64

Or you can get the elements that satisfy multiple conditions by writing the following

In [10]:
# you cannot use `or` `and` or `not` and only can use corresponding operator symbol(|, & and ~)
filter_condition = (s.isin([2, 5]) | (s<4)) & ~(s>2) 
print(filter_condition)
print(s[filter_condition])

0     True
1    False
2    False
3     True
4    False
dtype: bool
0    1
3    2
dtype: int64

### Operations and Mathematical Functions

The `Series` object can participate in common mathematical operations in a similar way to `Numpy` arrays.

In [11]:
s * 2.5

0     2.5
1     7.5
2    12.5
3     5.0
4    25.0
dtype: float64

In [12]:
np.exp(s)

0        2.718282
1       20.085537
2      148.413159
3        7.389056
4    22026.465795
dtype: float64

### Nan Value

The `NaN` refers to `Not a Number`, which is generally caused by the missing value. Before data analysis, the `NaN` values need to be addressed.

In [13]:
# Declaring a 'Series' including the NaN value
s = pd.Series([1, np.NaN, 10, 9, -2, np.NaN])
s

0     1.0
1     NaN
2    10.0
3     9.0
4    -2.0
5     NaN
dtype: float64

Call `isnull()` or `notnull()` functions to generate boolean value and get the indexes corresponding to the `NaN` value.

In [14]:
print(s.isnull())
print(s.notnull())

0    False
1     True
2    False
3    False
4    False
5     True
dtype: bool
0     True
1    False
2     True
3     True
4     True
5    False
dtype: bool

Based on the generated boolean value, the `Series` object with `NaN` value and without `NaN` can be generated by filtering methods mentioned above.

In [15]:
print(s[s.isnull()])
print(s[s.notnull()])

1   NaN
5   NaN
dtype: float64
0     1.0
2    10.0
3     9.0
4    -2.0
dtype: float64

### Operations of Multiple Series

In [16]:
s = pd.Series({"Singapore": 30, "Malaysia": 23, "Vietnam": 36, "Cambodia": 41})
s1 = pd.Series({"China": 51, "Japan": 73, "Vietnam": 36, "Laos": 31})
s * s1

Cambodia        NaN
China           NaN
Japan           NaN
Laos            NaN
Malaysia        NaN
Singapore       NaN
Vietnam      1296.0
dtype: float64

As you can see, we can only operate on the elements with the same indices in both series.

## DataFrame

Compared with the `Series`, the `DataFrame` can contain two-dimensional data. Its first column and first row are `index` and `columns`, respectively (for DataFrame without multiple indexes). 

|index|numeric|string|boolean|
|:--|:--:|:--:|--:|
|0|-1|Singapore|True|
|1|3|China|True|
|2|8|Japan|False|

### Defining a DataFrame

Call `DataFrame()` function to create a `DataFrame`. The `Array`, `List` and `dict` can all be the input of `data` argument.

In [17]:
df = pd.DataFrame([["Malaysia", "Kuala Lumpur", 'daodao', False],
                   ["Singapore", "Singapore", 5850342, True],
                   ["Vietnam", "Hanoi", 97338579, True]],
                  columns=["Country", "Capital", "Population", "Isdeveloped"],
                  index=["a", "b", "c"])
print(df)

     Country       Capital Population  Isdeveloped
a   Malaysia  Kuala Lumpur     daodao        False
b  Singapore     Singapore    5850342         True
c    Vietnam         Hanoi   97338579         True

In [18]:
# Array
df = pd.DataFrame(
    np.array([[14, 35, 35, 35], [19, 34, 57, 34], [42, 74, 49, 59]]))
print(df)

# List,  use 'columns' and 'index' parameters to specify the column and index of generated dataframe.
df = pd.DataFrame([["Malaysia", "Kuala Lumpur", 32365999, False],
                   ["Singapore", "Singapore", 5850342, True],
                   ["Vietnam", "Hanoi", 97338579, True]],
                  columns=["Country", "Capital", "Population", "Isdeveloped"],
                  index=["a", "b", "c"])
print(df)

# dict
df = pd.DataFrame({"Country": ["Malaysia", "Singapore", "Vietnam"],
                   "Capital": ["Kuala Lumpur", "Singapore", "Hanoi"],
                   "Population": [32365999, 5850342, 97338579],
                   "Isdeveloped": [False, True, True]},
                  index=["a", "b", "c"])
print(df)

    0   1   2   3
0  14  35  35  35
1  19  34  57  34
2  42  74  49  59
     Country       Capital  Population  Isdeveloped
a   Malaysia  Kuala Lumpur    32365999        False
b  Singapore     Singapore     5850342         True
c    Vietnam         Hanoi    97338579         True
     Country       Capital  Population  Isdeveloped
a   Malaysia  Kuala Lumpur    32365999        False
b  Singapore     Singapore     5850342         True
c    Vietnam         Hanoi    97338579         True

### Selecting the Internal Elements

Similar to `Series`, two ways can be used to select the elements from `DataFrame`. Call `iloc[]` and `loc[]` to select the elements by position and label, respectively .

In [19]:
# use ':' to represent select all
df.iloc[:, 0:2]

     Country       Capital
a   Malaysia  Kuala Lumpur
b  Singapore     Singapore
c    Vietnam         Hanoi

In [20]:
df.loc[:, "Country":"Population"]

     Country       Capital  Population
a   Malaysia  Kuala Lumpur    32365999
b  Singapore     Singapore     5850342
c    Vietnam         Hanoi    97338579

In [21]:
df.loc["a", ["Country", "Population"]]

Country       Malaysia
Population    32365999
Name: a, dtype: object

In [22]:
df.iloc[[0, 1]] # If you omit number of columns, all columns will be selected

     Country       Capital  Population  Isdeveloped
a   Malaysia  Kuala Lumpur    32365999        False
b  Singapore     Singapore     5850342         True

Use ```columns```,```index``` and ```values``` attributes to obtain corresponding object value.

In [23]:
df.index

Index(['a', 'b', 'c'], dtype='object')

In [24]:
df.columns

Index(['Country', 'Capital', 'Population', 'Isdeveloped'], dtype='object')

In [25]:
df.values

array([['Malaysia', 'Kuala Lumpur', 32365999, False],
       ['Singapore', 'Singapore', 5850342, True],
       ['Vietnam', 'Hanoi', 97338579, True]], dtype=object)

Select the corresponding column(s) according to the labels or indexes of columns.

In [26]:
df["Country"]

a     Malaysia
b    Singapore
c      Vietnam
Name: Country, dtype: object

In [27]:
df[["Country", "Population"]] # Use list to select multiple columns

     Country  Population
a   Malaysia    32365999
b  Singapore     5850342
c    Vietnam    97338579

In [28]:
df.Country # Also support as atrribute to select

a     Malaysia
b    Singapore
c      Vietnam
Name: Country, dtype: object

In [29]:
df["a":"b"] # using label-based slice to select multiple rows

     Country       Capital  Population  Isdeveloped
a   Malaysia  Kuala Lumpur    32365999        False
b  Singapore     Singapore     5850342         True

In [30]:
df[0:2] # using label-based number to select multiple rows

     Country       Capital  Population  Isdeveloped
a   Malaysia  Kuala Lumpur    32365999        False
b  Singapore     Singapore     5850342         True

### Assigning value

In [31]:
df1 = df.copy(True)
df1.loc["c", "Country"] = "Japan"
df1.loc["c", "Capital"] = "Tokyo"
df1.loc["c", "Population"] = 126476461
df1.loc["c", "Isdeveloped"] = True
df1

     Country       Capital  Population  Isdeveloped
a   Malaysia  Kuala Lumpur    32365999        False
b  Singapore     Singapore     5850342         True
c      Japan         Tokyo   126476461         True

In [32]:
df1.loc["c"] = ["Japan", "Tokyo", 126476461, True]
df

     Country       Capital  Population  Isdeveloped
a   Malaysia  Kuala Lumpur    32365999        False
b  Singapore     Singapore     5850342         True
c    Vietnam         Hanoi    97338579         True

### Assigning index, columns, and name of index and columns

In [33]:
df1.index = ["e", "f", "g"]
df1.index.name = "label"
df1.columns.name = "attributes"
df1.columns = ["Coun", "Cap", "Pop", "ID"]
df1

            Coun           Cap        Pop     ID
label
e       Malaysia  Kuala Lumpur   32365999  False
f      Singapore     Singapore    5850342   True
g          Japan         Tokyo  126476461   True

### Delete columns from dataframe

In [34]:
del df1["ID"]
# axis = 1 or columns represents delete columns
df1.drop(["Coun"], axis='columns', inplace=True)

# axis = 0 or rows represents delete columns
df1.drop(["e"], axis='rows', inplace=True)

df1

             Cap        Pop
label
f      Singapore    5850342
g          Tokyo  126476461

When `inplace=True` is passed, the modified `DataFrame` is used in place of the original one, and the operation itself returns `None`. When `inplace=False` is passed (this is the default value, so isn't necessary to specify), the function returns a copy of the modified `DataFrame`.

In [35]:
# inplace=True
df2 = df.copy(True)
print(df2)
print("----")
df2_return = df2.drop(["Country"], axis='columns', inplace=True)
print(df2)
print("----")
print(df2_return)

     Country       Capital  Population  Isdeveloped
a   Malaysia  Kuala Lumpur    32365999        False
b  Singapore     Singapore     5850342         True
c    Vietnam         Hanoi    97338579         True
----
        Capital  Population  Isdeveloped
a  Kuala Lumpur    32365999        False
b     Singapore     5850342         True
c         Hanoi    97338579         True
----
None

In [36]:
# inplace=False
df3 = df.copy(True)
print(df3)
print("----")
df3_return = df3.drop(["Country"], axis='columns', inplace=False)
print(df3)
print("----")
print(df3_return)

     Country       Capital  Population  Isdeveloped
a   Malaysia  Kuala Lumpur    32365999        False
b  Singapore     Singapore     5850342         True
c    Vietnam         Hanoi    97338579         True
----
     Country       Capital  Population  Isdeveloped
a   Malaysia  Kuala Lumpur    32365999        False
b  Singapore     Singapore     5850342         True
c    Vietnam         Hanoi    97338579         True
----
        Capital  Population  Isdeveloped
a  Kuala Lumpur    32365999        False
b     Singapore     5850342         True
c         Hanoi    97338579         True

### Filtering
Same as ```Series()``` mentioned above.

In [37]:
df2 = pd.DataFrame(np.array([[14, 35, 35, 35],
                             [19, 34, 57, 34],
                             [42, 74, 49, 59]]))
# filtering lesser than 30
df2[df2 < 30]

      0   1   2   3
0  14.0 NaN NaN NaN
1  19.0 NaN NaN NaN
2   NaN NaN NaN NaN

In [38]:
# Filtering accroding to conditions of one column
df[df["Population"] < 50000000]

     Country       Capital  Population  Isdeveloped
a   Malaysia  Kuala Lumpur    32365999        False
b  Singapore     Singapore     5850342         True

You can filter the `DataFrame` according to conditions of multiple columns like the following:

In [39]:
df[(df["Population"] < 50000000) & (df["Isdeveloped"] == True)]

     Country    Capital  Population  Isdeveloped
b  Singapore  Singapore     5850342         True

### Transposition  of a Dataframe
Similar to `Numpy` arrays, `Dataframe` can be transposed. `Columns` is interchanged with `Index`.

In [40]:
df1 = df.T
df1

                        a          b         c
Country          Malaysia  Singapore   Vietnam
Capital      Kuala Lumpur  Singapore     Hanoi
Population       32365999    5850342  97338579
Isdeveloped         False       True      True

In [41]:
df1.index

Index(['Country', 'Capital', 'Population', 'Isdeveloped'], dtype='object')

In [42]:
df1.columns

Index(['a', 'b', 'c'], dtype='object')

### Merge of Dataframe
Call `concat()`, `append()` functions to merge multiple dataframes.

In [43]:
df1 = pd.DataFrame(np.random.rand(3,4))
df2 = pd.DataFrame(np.random.rand(3,4))
df3 = pd.DataFrame(np.random.rand(6,4))
df4 = pd.DataFrame(np.random.rand(3,6))

In [44]:
# Vertical merging by default.
pd.concat([df1, df2, df3, df4])

          0         1         2         3         4         5
0  0.762714  0.858052  0.776502  0.638984       NaN       NaN
1  0.471129  0.267836  0.254934  0.253276       NaN       NaN
2  0.707000  0.777724  0.558135  0.986818       NaN       NaN
0  0.074334  0.126026  0.693853  0.912386       NaN       NaN
1  0.923675  0.611228  0.677037  0.468289       NaN       NaN
2  0.783764  0.636263  0.955992  0.948850       NaN       NaN
0  0.076652  0.323236  0.364225  0.592753       NaN       NaN
1  0.530635  0.670411  0.373705  0.312885       NaN       NaN
2  0.276990  0.854123  0.746126  0.203922       NaN       NaN
3  0.912820  0.000955  0.449610  0.837823       NaN       NaN
4  0.198221  0.405951  0.300153  0.774865       NaN       NaN
5  0.705421  0.537044  0.930815  0.067547       NaN       NaN
0  0.234938  0.463968  0.051037  0.309350  0.853706  0.905196
1  0.380458  0.198140  0.691971  0.759215  0.363329  0.516518
2  0.058123  0.392317  0.933684  0.663953  0.597008  0.935246

:::{note}
As you see, when the shapes of dataframes don't match, blank positions will be filled by `NaN` values.
:::

In [45]:
result = df1.append(df2)
result

          0         1         2         3
0  0.762714  0.858052  0.776502  0.638984
1  0.471129  0.267836  0.254934  0.253276
2  0.707000  0.777724  0.558135  0.986818
0  0.074334  0.126026  0.693853  0.912386
1  0.923675  0.611228  0.677037  0.468289
2  0.783764  0.636263  0.955992  0.948850

Conduct horizontal merging by specifying `axis` argument as 'columns' or 1.

In [46]:
pd.concat([df1, df2, df3, df4], axis='columns')

,0,1,2,3,0,1,2,3,0,1,2,3,0,1,2,3,4,5
0,0.762714,0.858052,0.776502,0.638984,0.074334,0.126026,0.693853,0.912386,0.076652,0.323236,0.364225,0.592753,0.234938,0.463968,0.051037,0.309350,0.853706,0.905196
1,0.471129,0.267836,0.254934,0.253276,0.923675,0.611228,0.677037,0.468289,0.530635,0.670411,0.373705,0.312885,0.380458,0.198140,0.691971,0.759215,0.363329,0.516518
2,0.707000,0.777724,0.558135,0.986818,0.783764,0.636263,0.955992,0.948850,0.276990,0.854123,0.746126,0.203922,0.058123,0.392317,0.933684,0.663953,0.597008,0.935246
3,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,0.912820,0.000955,0.449610,0.837823,NaN,NaN,NaN,NaN,NaN,NaN
4,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,0.198221,0.405951,0.300153,0.774865,NaN,NaN,NaN,NaN,NaN,NaN
5,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,0.705421,0.537044,0.930815,0.067547,NaN,NaN,NaN,NaN,NaN,NaN

### View data

In [47]:
df1 = pd.DataFrame(np.random.rand(100,4))
df1.head(2)

          0         1         2         3
0  0.120009  0.188495  0.907858  0.135513
1  0.234355  0.130909  0.168339  0.480043

In [48]:
df1.tail(3)

           0         1         2         3
97  0.616317  0.451546  0.598741  0.330549
98  0.421269  0.060775  0.201096  0.959810
99  0.744710  0.924623  0.887182  0.311219

### Computational tools

Compute covariance and *Pearson correlation coefficients* between different columns.

In [49]:
df1 = pd.DataFrame(np.random.rand(5, 5), index=['i1', 'i2', 'i3', 'i4', 'i5'],
                   columns=['c1', 'c2', 'c3', 'c4', 'c5'])
df1.cov()

          c1        c2        c3        c4        c5
c1  0.072849  0.010317 -0.029626  0.039523  0.038606
c2  0.010317  0.052021  0.044289  0.010545  0.043784
c3 -0.029626  0.044289  0.085641  0.002518  0.012171
c4  0.039523  0.010545  0.002518  0.039808  0.002057
c5  0.038606  0.043784  0.012171  0.002057  0.082732

In [50]:
df1.corr() # method = pearson (default), optional: kendall, spearman

          c1        c2        c3        c4        c5
c1  1.000000  0.167595 -0.375082  0.733923  0.497288
c2  0.167595  1.000000  0.663530  0.231728  0.667411
c3 -0.375082  0.663530  1.000000  0.043122  0.144595
c4  0.733923  0.231728  0.043122  1.000000  0.035848
c5  0.497288  0.667411  0.144595  0.035848  1.000000

In [51]:
df1.corr(method='kendall')

     c1   c2   c3   c4   c5
c1  1.0  0.2 -0.4  0.6  0.0
c2  0.2  1.0  0.4 -0.2  0.4
c3 -0.4  0.4  1.0  0.0 -0.2
c4  0.6 -0.2  0.0  1.0 -0.4
c5  0.0  0.4 -0.2 -0.4  1.0

Compute the average value, maximum, minimum and sum of different columns or rows.

In [52]:
# compute average value of each column by default.
df1.mean()

c1    0.270279
c2    0.583126
c3    0.513368
c4    0.594373
c5    0.513454
dtype: float64

Compute the sum of each row by specifying the `axis` argument as 'columns' or 1.

In [53]:
df1.sum(axis=1)

i1    1.783832
i2    2.723690
i3    2.868875
i4    3.505750
i5    1.490860
dtype: float64

Display a summary of the characteristics of the dataframe

In [54]:
df1.describe()

             c1        c2        c3        c4        c5
count  5.000000  5.000000  5.000000  5.000000  5.000000
mean   0.270279  0.583126  0.513368  0.594373  0.513454
std    0.269905  0.228082  0.292646  0.199518  0.287631
min    0.032103  0.304754  0.110865  0.385178  0.260918
25%    0.151029  0.382652  0.378931  0.448209  0.309769
50%    0.199557  0.681723  0.491654  0.526626  0.349577
75%    0.235567  0.708488  0.738092  0.804465  0.766280
max    0.733140  0.838012  0.847301  0.807389  0.880727

### Data ranking

In [55]:
df1 = df.copy(deep=True)
df1.sort_values(by=['Population', 'Country'], ascending=False, na_position='first')

     Country       Capital  Population  Isdeveloped
c    Vietnam         Hanoi    97338579         True
a   Malaysia  Kuala Lumpur    32365999        False
b  Singapore     Singapore     5850342         True

## NaN value

In [56]:
df1 = pd.DataFrame(np.random.rand(5, 5), index=['i1', 'i2', 'i3', 'i4', 'i5'],
                   columns=['c1', 'c2', 'c3', 'c4', 'c5'])
df1.iloc[0, 1] = np.nan
df1.iloc[2, 2] = np.nan
df1.iloc[3, 1] = np.nan
df1.iloc[3, 3] = np.nan
df1

          c1        c2        c3        c4        c5
i1  0.395908       NaN  0.023958  0.068045  0.167061
i2  0.829452  0.347866  0.230082  0.263961  0.281139
i3  0.414833  0.764508       NaN  0.351841  0.732755
i4  0.441945       NaN  0.411494       NaN  0.960713
i5  0.292331  0.366752  0.915061  0.908130  0.084584

In [57]:
# detecting nan value
print(df1.isnull())
print(df1.notnull())
print(df1.isna())

       c1     c2     c3     c4     c5
i1  False   True  False  False  False
i2  False  False  False  False  False
i3  False  False   True  False  False
i4  False   True  False   True  False
i5  False  False  False  False  False
      c1     c2     c3     c4    c5
i1  True  False   True   True  True
i2  True   True   True   True  True
i3  True   True  False   True  True
i4  True  False   True  False  True
i5  True   True   True   True  True
       c1     c2     c3     c4     c5
i1  False   True  False  False  False
i2  False  False  False  False  False
i3  False  False   True  False  False
i4  False   True  False   True  False
i5  False  False  False  False  False

After detecting `NaN` with Boolean values, you can easily get the number of `NaN` values

In [58]:
# False:0, True:1
df1.isnull().sum(axis=1)

i1    1
i2    0
i3    1
i4    2
i5    0
dtype: int64

Fill `NaN` with a specific value or a value generated by some rules

In [59]:
# fill NaN value using a specific value
df1.fillna(value=0)

          c1        c2        c3        c4        c5
i1  0.395908  0.000000  0.023958  0.068045  0.167061
i2  0.829452  0.347866  0.230082  0.263961  0.281139
i3  0.414833  0.764508  0.000000  0.351841  0.732755
i4  0.441945  0.000000  0.411494  0.000000  0.960713
i5  0.292331  0.366752  0.915061  0.908130  0.084584

In [60]:
# fill NaN value using a method
# set inplace to True, the changes will act on dataframe
df1.fillna(method="ffill") # other method: backfill, bfill, pad

          c1        c2        c3        c4        c5
i1  0.395908       NaN  0.023958  0.068045  0.167061
i2  0.829452  0.347866  0.230082  0.263961  0.281139
i3  0.414833  0.764508  0.230082  0.351841  0.732755
i4  0.441945  0.764508  0.411494  0.351841  0.960713
i5  0.292331  0.366752  0.915061  0.908130  0.084584

In [61]:
df1.fillna(method="pad")

          c1        c2        c3        c4        c5
i1  0.395908       NaN  0.023958  0.068045  0.167061
i2  0.829452  0.347866  0.230082  0.263961  0.281139
i3  0.414833  0.764508  0.230082  0.351841  0.732755
i4  0.441945  0.764508  0.411494  0.351841  0.960713
i5  0.292331  0.366752  0.915061  0.908130  0.084584

In [62]:
# delete NaN value
# any : If any NA values are present, drop that row or column.
# all : If all values are NA, drop that row or column.

# 0, or index : Drop rows which contain missing values.
# 1, or columns : Drop columns which contain missing value.
df1.dropna(axis="index", how="any")

          c1        c2        c3        c4        c5
i2  0.829452  0.347866  0.230082  0.263961  0.281139
i5  0.292331  0.366752  0.915061  0.908130  0.084584

## Date index

Date index is very useful for you to deal with time series. You can create a date index by the `date_range` function. The date index mentioned here is usually discrete with equal intervals and it usually has three features: starting date, end date, and frequency (or intervals).

In [63]:
dti = pd.date_range("2018-01-01", periods=3, freq="H")
print(dti)
dti = pd.date_range(start="2021-09-28", end="2021-09-30", freq="10H")
print(dti)

DatetimeIndex(['2018-01-01 00:00:00', '2018-01-01 01:00:00',
               '2018-01-01 02:00:00'],
              dtype='datetime64[ns]', freq='H')
DatetimeIndex(['2021-09-28 00:00:00', '2021-09-28 10:00:00',
               '2021-09-28 20:00:00', '2021-09-29 06:00:00',
               '2021-09-29 16:00:00'],
              dtype='datetime64[ns]', freq='10H')

Manipulating and converting date times with timezone information

In [64]:
dti = pd.date_range(start="2021-09-28", end="2021-09-30", freq="10H")
dti = dti.tz_localize("UTC")
dti

DatetimeIndex(['2021-09-28 00:00:00+00:00', '2021-09-28 10:00:00+00:00',
               '2021-09-28 20:00:00+00:00', '2021-09-29 06:00:00+00:00',
               '2021-09-29 16:00:00+00:00'],
              dtype='datetime64[ns, UTC]', freq='10H')

In [65]:
dti = pd.date_range(start="2021-09-28", end="2021-09-30", freq="10H")
dti = dti.tz_localize("Asia/Singapore")
dti

DatetimeIndex(['2021-09-28 00:00:00+08:00', '2021-09-28 10:00:00+08:00',
               '2021-09-28 20:00:00+08:00', '2021-09-29 06:00:00+08:00',
               '2021-09-29 16:00:00+08:00'],
              dtype='datetime64[ns, Asia/Singapore]', freq=None)

Using the `origin` option, one can specify an alternative starting point for the creation of a `DatetimeIndex`. For example, to use 1900-01-01 00:00:00 as the starting time and hour as the unit period length:

In [66]:
pd.to_datetime([100, 101, 102], unit="h", origin=pd.Timestamp("1900-01-01 00:00:00"))

DatetimeIndex(['1900-01-05 04:00:00', '1900-01-05 05:00:00',
               '1900-01-05 06:00:00'],
              dtype='datetime64[ns]', freq=None)

Supported units are `D`: day, `h`: hour, `m`: minute, and `s`: second.

:::{tip}
The time labels of climate products is usually given as a start time point and discrete time interval, and then represented by a column of integers. In this case, we can use the above ways to construct time labels.
:::

## Upsampling and Downsampling

* Upsampling: Increase the frequency of the samples by interpolation, such as from minutes to seconds. 
* Downsampling: Decrease the frequency of the samples by aggregation, such as from months to years.

In [67]:
# prepare data, this section will be introduced in the next tutorial
# Data Source: http://www.weather.gov.sg/climate-historical-daily/
data = pd.read_csv('../../assets/data/Changi_daily_rainfall.csv', index_col=0, header=0, parse_dates=True)
data.head()

            Daily Rainfall Total (mm)
Date
1981-01-01                        0.0
1981-01-02                        0.0
1981-01-03                        0.0
1981-01-04                        0.0
1981-01-05                        0.0

In [68]:
# Downsampling: Convert monthly data to yearly data by sum or max
df = data.copy(deep=True)
dfsum = df.resample("Y").sum()
dfsum.columns = ["Yearly Rainfall Total (mm)"]
dfsum.head()

            Yearly Rainfall Total (mm)
Date
1981-12-31                      1336.3
1982-12-31                      1581.7
1983-12-31                      1866.5
1984-12-31                      2686.7
1985-12-31                      1483.9

In [69]:
dfmax = df.resample("Y").max()
dfmax.columns = ["Yearly Rainfall Maximum (mm)"]
dfmax.head()

            Yearly Rainfall Maximum (mm)
Date
1981-12-31                          71.5
1982-12-31                         109.0
1983-12-31                         181.8
1984-12-31                         154.4
1985-12-31                          86.8

In [70]:
# Upsampling: Convert monthly data to 10 days' data 
# by directly return (asfreq) or forward filling (pad/ffill)
dfmax.resample('10D').asfreq()[0:5]

            Yearly Rainfall Maximum (mm)
Date
1981-12-31                          71.5
1982-01-10                           NaN
1982-01-20                           NaN
1982-01-30                           NaN
1982-02-09                           NaN

In [71]:
dfmax.resample('10D').pad()[0:5]

            Yearly Rainfall Maximum (mm)
Date
1981-12-31                          71.5
1982-01-10                          71.5
1982-01-20                          71.5
1982-01-30                          71.5
1982-02-09                          71.5

In [72]:
dfmax.resample('D').ffill(limit=2)[0:5]

            Yearly Rainfall Maximum (mm)
Date
1981-12-31                          71.5
1982-01-01                          71.5
1982-01-02                          71.5
1982-01-03                           NaN
1982-01-04                           NaN

## Group DataFrame

You can group `DataFrame` using a mapper or by a Series of columns via the `groupby` function.

In [73]:
# Calculate average and maximum wind speed of each station
df = pd.DataFrame({'Station': ['Changi', 'Changi',
                              'Climenti', 'Climenti'],
                   'Wind Speed': [10., 5., 6., 16.]})
print(df.groupby(['Station']).mean())
print(df.groupby(['Station']).max())

          Wind Speed
Station
Changi           7.5
Climenti        11.0
          Wind Speed
Station
Changi          10.0
Climenti        16.0

You can also apply custom function to manipulate each group data via `.apply()` function

In [74]:
# custom function
df = pd.DataFrame({'Station': ['Changi', 'Changi', 'Changi',
                              'Climenti', 'Climenti', 'Climenti'],
                   'Wind Speed': [10., 5., 12, 6., 16., 20]})
def groupNormalization(w):
    return (w-w.min())/(w.max()-w.min())
df.groupby(['Station']).apply(groupNormalization)

   Wind Speed
0    0.714286
1    0.000000
2    1.000000
3    0.000000
4    0.714286
5    1.000000

## Input/Output of data

Typically, you can read data from files ending with ". xlsx" and ". csv" using `read_excel()` and `read_csv()` functions, respectively. The `index_col` and `header` arguments are used to specify the column and row to be used as `index` and `columns` of the dataframe. You can also set `parse_dates` as `True` to parse `index` as the date format. If your date format is uncommon, you can specify the `date_parser` argument to be a function for converting a sequence of string columns to an array of datetime instances.

In [75]:
df = pd.read_csv('../../assets/data/Changi_daily_rainfall.csv', index_col=0, header=0, 
                 parse_dates=True)
df.head()

            Daily Rainfall Total (mm)
Date
1981-01-01                        0.0
1981-01-02                        0.0
1981-01-03                        0.0
1981-01-04                        0.0
1981-01-05                        0.0

In [76]:
custom_dateparse = lambda x: pd.to_datetime(x, format='%Y-%m-%d')
df = pd.read_csv('../../assets/data/Changi_daily_rainfall.csv', index_col=0, header=0, 
                 parse_dates=True, date_parser=custom_dateparse)
df.head()

            Daily Rainfall Total (mm)
Date
1981-01-01                        0.0
1981-01-02                        0.0
1981-01-03                        0.0
1981-01-04                        0.0
1981-01-05                        0.0

You can also specify the `parse_dates` argument as a `list` to parse a column as a date format.

In [77]:
df = pd.read_csv('../../assets/data/Changi_daily_rainfall.csv', index_col=0, header=0, 
                 parse_dates=[0])
df.head()

            Daily Rainfall Total (mm)
Date
1981-01-01                        0.0
1981-01-02                        0.0
1981-01-03                        0.0
1981-01-04                        0.0
1981-01-05                        0.0

The usage of `read_excel()` function is the same as the `read_csv()`

:::{tip}
1. The `Series` objects can be regarded as the special `DataFrames` object. Actually, when you extract one column from the `DataFrames`, it will be converted to the `Series`.
2. The `DataFrame` object has many of the same usages as the `Numpy` array and you can learn by analogy.
:::

## References
+ [Pandas documentation](https://pandas.pydata.org/docs/).
+ [10 minutes to pandas](https://pandas.pydata.org/pandas-docs/stable/user_guide/10min.html)
+ [Python Data Analytics](https://www.apress.com/gp/book/9781484209585)